Documents/ПакетноеСозданиеМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПакетноеСозданиеМероприятий</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемоеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемоеВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПакетноеСозданиеМероприятий/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Автор,
	                      |	Мероприятие.Объект,
	                      |	Мероприятие.Организация,
	                      |	Мероприятие.Ответственный,
	                      |	Мероприятие.ПланируемаяДата,
	                      |	Мероприятие.Подразделение,
	                      |	Мероприятие.ТипМероприятия
	                      |ПОМЕСТИТЬ СуществующиеМероприятия
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	Мероприятие.Автор = &Автор
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПакетноеСозданиеМероприятийОбъекты.Ссылка.Ссылка,
	                      |	ПакетноеСозданиеМероприятийОбъекты.Ссылка.Организация,
	                      |	ПакетноеСозданиеМероприятийОбъекты.Ссылка.Подразделение,
	                      |	ПакетноеСозданиеМероприятийОбъекты.Ссылка.Ответственный,
	                      |	ПакетноеСозданиеМероприятийОбъекты.Ссылка.ТипМероприятия,
	                      |	ПакетноеСозданиеМероприятийОбъекты.Ссылка.ПланируемаяДата,
	                      |	ПакетноеСозданиеМероприятийОбъекты.Объект
	                      |ПОМЕСТИТЬ ТЧ
	                      |ИЗ
	                      |	Документ.ПакетноеСозданиеМероприятий.Объекты КАК ПакетноеСозданиеМероприятийОбъекты
	                      |ГДЕ
	                      |	ПакетноеСозданиеМероприятийОбъекты.Ссылка = &Автор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.Организация,
	                      |	ТЧ.Подразделение,
	                      |	ТЧ.Ответственный,
	                      |	ТЧ.ТипМероприятия,
	                      |	ТЧ.ПланируемаяДата,
	                      |	ТЧ.Объект,
	                      |	СуществующиеМероприятия.Ссылка КАК Мероприятие,
	                      |	ВЫБОР
	                      |		КОГДА СуществующиеМероприятия.Ссылка ЕСТЬ NULL 
	                      |			ТОГДА ""Создать""
	                      |		ИНАЧЕ ВЫБОР
	                      |				КОГДА ТЧ.Объект ЕСТЬ NULL 
	                      |					ТОГДА ""Удалить""
	                      |				ИНАЧЕ ""Обновить""
	                      |			КОНЕЦ
	                      |	КОНЕЦ КАК Статус
	                      |ИЗ
	                      |	ТЧ КАК ТЧ
	                      |		ПОЛНОЕ СОЕДИНЕНИЕ СуществующиеМероприятия КАК СуществующиеМероприятия
	                      |		ПО ТЧ.Объект = СуществующиеМероприятия.Объект");
	Запрос.УстановитьПараметр("Автор", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.Статус = "Создать" Тогда
			НовоеМероприятие = Задачи.Мероприятие.СоздатьЗадачу();
			НовоеМероприятие.Дата = ЭтотОбъект.Дата;
			Если ТипЗнч(Ответственный)=Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Ответственный) Тогда
				НовоеМероприятие.Организация = Ответственный.Организация;
				НовоеМероприятие.Подразделение = Ответственный.Подразделение;
			Иначе
				НовоеМероприятие.Организация = Организация;
				НовоеМероприятие.Подразделение = Подразделение;
			КонецЕсли;
			НовоеМероприятие.Ответственный = Ответственный;
			НовоеМероприятие.ТипМероприятия = ТипМероприятия;
			НовоеМероприятие.Объект = Результат.Объект;
			НовоеМероприятие.ПланируемаяДата = ПланируемаяДата;
			НовоеМероприятие.ПланируемоеВремя = ПланируемоеВремя;
			НовоеМероприятие.ПланируемоеВремяКонца = ПланируемоеВремяКонца;
			НовоеМероприятие.Автор = ЭтотОбъект.Ссылка;
			НовоеМероприятие.Комментарий = Комментарий;	
			//++КазанцевЯА-БП
			Если Константы.КонтрольСроковМероприятий.Получить() И НовоеМероприятие.ТипМероприятия.СрокВыполнения > 0 Тогда 
				ВремяКон = ?(ЗначениеЗаполнено(ПланируемоеВремяКонца),ПланируемоеВремяКонца,ПланируемоеВремя);
				НовоеМероприятие.СрокВыполнения = Дата(1,1,1) + (ПланируемаяДата - Дата(1,1,1)) + (ВремяКон - Дата(1,1,1)) + НовоеМероприятие.ТипМероприятия.СрокВыполнения * 60;
				ОсновнойКалендарьПредприятия = Константы.ОсновнойКалендарьПредприятия.Получить();
				Если Константы.ПереноситьВыходныеИПраздникиМероприятий.Получить() И ЗначениеЗаполнено(ОсновнойКалендарьПредприятия) Тогда
					УстановитьПривилегированныйРежим(Истина);
					ПроизводственныйКалендарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнойКалендарьПредприятия, "ПроизводственныйКалендарь");
					ПараметрыПолучения = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат();
					ПараметрыПолучения.ПолучатьПредшествующие = Ложь;
					ПараметрыПолучения.ВызыватьИсключение = Ложь;
					свДата = НачалоДня(НовоеМероприятие.СрокВыполнения);
					свВремя =  НовоеМероприятие.СрокВыполнения - свДата;
					мСрокВыполнения = Новый Массив;
					мСрокВыполнения.Добавить(свДата);
					ДниКалендаря = КалендарныеГрафики.БлижайшиеРабочиеДаты(ПроизводственныйКалендарь, мСрокВыполнения, ПараметрыПолучения);
					НовоеМероприятие.СрокВыполнения = ДниКалендаря.Получить(свДата) + свВремя;
					УстановитьПривилегированныйРежим(Ложь);	
				КонецЕсли;
			КонецЕсли;
			//--КазанцевЯА-БП
			НовоеМероприятие.Записать();
			
		ИначеЕсли Результат.Статус = "Удалить" Тогда                            
			Мероприятие = Результат.Мероприятие.ПолучитьОбъект();
			Мероприятие.ПометкаУдаления = Истина;
			Мероприятие.Записать();
			
		ИначеЕсли Результат.Статус = "Обновить" Тогда
			Мероприятие = Результат.Мероприятие.ПолучитьОбъект();
			Мероприятие.Дата = ЭтотОбъект.Дата;
			Если ТипЗнч(Ответственный)=Тип("СправочникСсылка.Пользователи") и ЗначениеЗаполнено(Ответственный) Тогда
				Мероприятие.Организация = Ответственный.Организация;
				Мероприятие.Подразделение = Ответственный.Подразделение;
			Иначе
				Мероприятие.Организация = Организация;
				Мероприятие.Подразделение = Подразделение;
			КонецЕсли;
			Мероприятие.Ответственный = Ответственный;
			Мероприятие.ТипМероприятия = ТипМероприятия;
			Мероприятие.Объект = Результат.Объект;
			Мероприятие.ПланируемаяДата = ПланируемаяДата;
			Мероприятие.ПланируемоеВремя = ПланируемоеВремя;
			Мероприятие.ПланируемоеВремяКонца = ПланируемоеВремяКонца;
			Мероприятие.Автор = ЭтотОбъект.Ссылка;
			Мероприятие.Комментарий = Комментарий;
			Мероприятие.Записать();
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Мероприятие.Ссылка
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	Мероприятие.Автор = &Автор
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ");
	Запрос.УстановитьПараметр("Автор", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Мероприятие = Результат.Ссылка.ПолучитьОбъект();
		Мероприятие.ПометкаУдаления = Истина;
		Мероприятие.Записать();
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
